# Heather's Anomaly Detection Project Notebook
by Heather Ortega McMillan

This is the initial notebook compiled by Heather. For full project details see the Final Notebook

In [5]:
import pandas as pd
import numpy as np

from acquire import get_joined_curriculum_data

import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings("ignore")

In [2]:
df = get_joined_curriculum_data()

1. Which lesson appears to attract the most traffic consistently across cohorts (per program)?
    - cohort pulled from the sql table 
    - sort all the endpoints 
    
7. Which lessons are least accessed?
    - kind of related to 2

LUPE ^^^^ 

### Question I'm tackling 
2. Is there a cohort that referred to a lesson significantly more than other cohorts seemed to gloss over?
    - divided web dev and data science (4 different programs)
    - sort all the endpoints 
    - counts of cohorts accessing same endpoints
    

    

### Program ID Key 
1 - Full stack PHP

2 - Java

3 - Data Science

4 - Front End Program

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1018810 entries, 0 to 1018809
Data columns (total 10 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   date        1018810 non-null  object
 1   endpoint    1018810 non-null  object
 2   user_id     1018810 non-null  int64
 3   cohort_id   1018810 non-null  float64
 4   source_ip   1018810 non-null  object
 5   id          1018810 non-null  float64
 6   name        1018810 non-null  object
 7   start_date  1018810 non-null  object
 8   end_date    1018810 non-null  object
 9   program_id  1018810 non-null  float64
dtypes: float64(3), int64(1), object(6)
memory usage: 85.5+ MB

In [10]:
# deal with nulls by filling with 0s
#df.cohort_id.value_counts(dropna=False)

In [ ]:
# Fill nulls
def fill_nulls(df):
    '''
    This function fills the nulls in the joined curriculum log data
    '''
    df = df.fillna(value = 0)
    
    return df

In [20]:
df = df.fillna(value = 0)

In [28]:
df[df.name == 0]

               date                               endpoint  user_id  cohort_id  ... name start_date end_date program_id
411      2018-01-26                                      /       48        0.0  ...    0          0        0        0.0
412      2018-01-26  spring/extra-features/form-validation       48        0.0  ...    0          0        0        0.0
425      2018-01-26                                      /       48        0.0  ...    0          0        0        0.0
435      2018-01-26                                      /       48        0.0  ...    0          0        0        0.0
436      2018-01-26              mysql/relationships/joins       48        0.0  ...    0          0        0        0.0
...             ...                                    ...      ...        ...  ...  ...        ...      ...        ...
1018759  2021-07-15                  python/intro-to-numpy     1026      165.0  ...    0          0        0        0.0
1018778  2021-07-15                  python/intro-to-numpy     1051      165.0  ...    0          0        0        0.0
1018785  2021-07-15                  python/intro-to-numpy     1037      165.0  ...    0          0        0        0.0
1018786  2021-07-15                  python/intro-to-numpy     1041      165.0  ...    0          0        0        0.0
1018802  2021-07-15                  python/intro-to-numpy     1048      165.0  ...    0          0        0        0.0

[64497 rows x 9 columns]

#### Takeaways
- Newer people with no cohort id must be from Germaine and the Web Dev cohorts that just started

In [ ]:
# Is there a cohort that referred to a lesson significantly more than other cohorts seemed to 
# gloss over?


# See Lessons (endpoint) Count of each cohort access 

df['endpoint', 'cohort']

In [31]:
df[['name', 'cohort_id']].value_counts()

name        cohort_id
Staff       28.0         96954
0           0.0          53497
Ceres       33.0         40858
Jupiter     62.0         39316
Zion        29.0         38198
Fortuna     53.0         37043
Voyageurs   24.0         35707
Deimos      51.0         35381
Ganymede    57.0         34919
Apex        56.0         34172
Marco       135.0        34093
Darden      59.0         32871
Teddy       22.0         31258
Hyperion    58.0         30137
Betelgeuse  32.0         29754
Ulysses     23.0         28581
Europa      52.0         28177
Xanadu      26.0         27811
Bayes       34.0         27261
Wrangell    25.0         25680
Andromeda   31.0         25372
Kalypso     132.0        24978
Neptune     138.0        23744
Curie       55.0         22064
Florence    137.0        21435
Luna        134.0        21095
Yosemite    27.0         20864
Arches      1.0          19063
Easley      133.0        18371
Bash        61.0         18212
Oberon      139.0        17745
Lassen      14.0          9596
0           165.0         9171
Sequoia     21.0          7444
Olympic     17.0          4960
Kings       13.0          2848
Pinnacles   18.0          2257
0           166.0         1829
Hampton     8.0           1712
Quincy      19.0          1371
Glacier     7.0            833
Niagara     16.0           755
Mammoth     15.0           691
Joshua      12.0           302
Ike         11.0           253
Badlands    2.0             95
Franklin    6.0             72
Apollo      9.0              5
Denali      4.0              4
Everglades  5.0              1
dtype: int64

####  New info from Zach
Because I copy pasted this information, in order to get an up to date list of cohorts, I added these new entries onto the new dataframe in a notebook, then saved it as a csv for future use. 

``` 
+-----+---------+----------+------------+------------+---------------------+---------------------+------------+------------+
| id  | name    | slack    | start_date | end_date   | created_at          | updated_at          | deleted_at | program_id |
+-----+---------+----------+------------+------------+---------------------+---------------------+------------+------------+
| 138 | Neptune | #neptune | 2021-03-15 | 2021-09-03 | 2021-03-15 19:57:09 | 2021-03-15 19:57:09 | NULL       |          2 |
| 139 | Oberon  | #oberon  | 2021-04-12 | 2021-10-01 | 2021-04-12 18:07:21 | 2021-04-12 18:07:21 | NULL       |          2 |
| 140 | Polaris | #polaris | 2021-05-24 | 2021-11-16 | 2021-05-24 21:12:37 | 2021-05-24 21:12:37 | NULL       |          2 |
| 165 | Germain | #germain | 2021-06-14 | 2021-12-07 | 2021-06-15 13:29:36 | 2021-06-15 13:29:36 | NULL       |          3 |
| 166 | Draco   | #draco   | 2021-06-28 | 2022-01-03 | 2021-06-27 20:47:56 | 2021-06-27 20:47:56 | NULL       |          2 |
+-----+---------+----------+------------+------------+---------------------+---------------------+------------+------------+
```

In [41]:
# read in from clipboard copy pasted in google sheets
# Not reproduciable 
# need to put in csv for future use
cohorts2 = pd.read_clipboard(sep='|').drop(columns = ['Unnamed: 0', 'Unnamed: 10'])

In [7]:
import acquire as a

In [8]:
cohorts1 = a.get_cohort_data()

In [9]:
cohorts1.head()

,id,name,slack,start_date,end_date,created_at,updated_at,deleted_at,program_id
0,1,Arches,#arches,2014-02-04,2014-04-22,2016-06-14 19:52:26,2016-06-14 19:52:26,None,1
1,2,Badlands,#badlands,2014-06-04,2014-08-22,2016-06-14 19:52:26,2016-06-14 19:52:26,None,1
2,3,Carlsbad,#carlsbad,2014-09-04,2014-11-05,2016-06-14 19:52:26,2016-06-14 19:52:26,None,1
3,4,Denali,#denali,2014-10-20,2015-01-18,2016-06-14 19:52:26,2016-06-14 19:52:26,None,1
4,5,Everglades,#everglades,2014-11-18,2015-02-24,2016-06-14 19:52:26,2016-06-14 19:52:26,None,1

In [61]:
cohorts2

    id     name       slack       start_date   ...   created_at             updated_at             deleted_at   program_id
0    138   Neptune    #neptune    2021-03-15   ...   2021-03-15 19:57:09    2021-03-15 19:57:09    NULL                   2
1    139   Oberon     #oberon     2021-04-12   ...   2021-04-12 18:07:21    2021-04-12 18:07:21    NULL                   2
2    140   Polaris    #polaris    2021-05-24   ...   2021-05-24 21:12:37    2021-05-24 21:12:37    NULL                   2
3    165   Germain    #germain    2021-06-14   ...   2021-06-15 13:29:36    2021-06-15 13:29:36    NULL                   3
4    166   Draco      #draco      2021-06-28   ...   2021-06-27 20:47:56    2021-06-27 20:47:56    NULL                   2

[5 rows x 9 columns]

In [10]:
col_names = list(cohorts1)

In [43]:
# rename columns in 2nd dataframe
cohorts2.columns = col_names

In [46]:
cohorts2['name']= cohorts2.name.str.strip()

In [47]:
# concat both dataframes together
full_cohorts = pd.concat([cohorts1, cohorts2], ignore_index=True, keys=list(cohorts1))

In [48]:
full_cohorts.tail(7)

,id,name,slack,start_date,end_date,created_at,updated_at,deleted_at,program_id
51,138,Neptune,#neptune,2021-03-15,2021-09-03,2021-03-15 19:57:09,2021-03-15 19:57:09,None,2
52,139,Oberon,#oberon,2021-04-12,2021-10-01,2021-04-12 18:07:21,2021-04-12 18:07:21,None,2
53,138,Neptune,#neptune,2021-03-15,2021-09-03,2021-03-15 19:57:09,2021-03-15 19:57:09,NULL,2
54,139,Oberon,#oberon,2021-04-12,2021-10-01,2021-04-12 18:07:21,2021-04-12 18:07:21,NULL,2
55,140,Polaris,#polaris,2021-05-24,2021-11-16,2021-05-24 21:12:37,2021-05-24 21:12:37,NULL,2
56,165,Germain,#germain,2021-06-14,2021-12-07,2021-06-15 13:29:36,2021-06-15 13:29:36,NULL,3
57,166,Draco,#draco,2021-06-28,2022-01-03,2021-06-27 20:47:56,2021-06-27 20:47:56,NULL,2

In [49]:
# remove duplicates (oberon and neptune)
full_cohorts = full_cohorts.drop_duplicates(subset = 'id')

In [50]:
full_cohorts['name'] = full_cohorts.name.str.strip()

In [52]:
full_cohorts.to_csv('full_cohort_list.csv', index=False)

In [91]:
test = pd.read_csv('full_cohort_list.csv')

In [10]:
df = df.fillna(value = 0)

In [35]:
df[df['name'] == 'Germain']

,date,endpoint,user_id,cohort_id,source_ip,name,start_date,end_date,program_id
974406,2021-06-15,/,1026,165.0,24.242.17.211,Germain,2021-06-14,2021-12-07,3.0
974407,2021-06-15,/,1027,165.0,69.153.21.120,Germain,2021-06-14,2021-12-07,3.0
974408,2021-06-15,/,1028,165.0,99.66.110.207,Germain,2021-06-14,2021-12-07,3.0
974409,2021-06-15,/,1029,165.0,67.10.172.51,Germain,2021-06-14,2021-12-07,3.0
974410,2021-06-15,/,1030,165.0,162.238.132.211,Germain,2021-06-14,2021-12-07,3.0
...,...,...,...,...,...,...,...,...,...
1018759,2021-07-15,python/intro-to-numpy,1026,165.0,24.242.17.211,Germain,2021-06-14,2021-12-07,3.0
1018778,2021-07-15,python/intro-to-numpy,1051,165.0,209.182.242.80,Germain,2021-06-14,2021-12-07,3.0
1018785,2021-07-15,python/intro-to-numpy,1037,165.0,173.174.155.221,Germain,2021-06-14,2021-12-07,3.0
1018786,2021-07-15,python/intro-to-numpy,1041,165.0,70.235.249.134,Germain,2021-06-14,2021-12-07,3.0
1018802,2021-07-15,python/intro-to-numpy,1048,165.0,107.207.1.231,Germain,2021-06-14,2021-12-07,3.0

In [37]:
# save as csv 
# needs to stay commented out in order so we don't save over the file
# df.to_csv('full_cohort_list.csv', index = False)

## Is there a cohort that referred to a lesson significantly more than other cohorts seemed to gloss over?

In [ ]:
cohort_list = df.name.to_list()

In [ ]:
for prog in program_list:
    program_df = pd.DataFrame(df).groupby('program_id')['endpoint'].value_counts()
    program_df = program_df[program_df > 3]
    cep_df = program_df.loc[[prog]]
    cep_df = cep_df.nsmallest(3)
    print(cep_df)
    print('\n')